Documents/ESB/ESB_Consumer_1016/003TestSample/SAMPLE_XML_MUST/CustomerTax/CT07_FATCAModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CustomerTax/FATCAModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CustomerTax</ServiceDomain>  
      <OperationName>FATCAMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:FATCAModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CT07</v11:TxnId>  
        <v11:TxnNo>CT0700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:CIFNo>1000000004</v11:CIFNo>  
        <!--Zero or more repetitions:-->  
        <v11:NatlRec></v11:NatlRec>  
        <!--Zero or more repetitions:-->  
        <v11:TINRec></v11:TINRec>  
        <!--Zero or more repetitions:-->  
        <v11:OwnrRec></v11:OwnrRec>  
        <!--Zero or more repetitions:-->  
        <v11:JointAcctRec></v11:JointAcctRec>  
        <!--Optional:-->  
        <v11:FATCAStat>RECALCITRANT</v11:FATCAStat>  
        <!--Zero or more repetitions:-->  
        <v11:NoTINRec></v11:NoTINRec>  
        <!--Zero or more repetitions:-->  
        <v11:NatlAddrRec></v11:NatlAddrRec>  
        <!--Optional:-->  
        <v11:APIKey>NCB-IF99002</v11:APIKey> 
      </v11:ServiceBody> 
    </v11:FATCAModRq> 
  </soap:Body> 
</soap:Envelope>
